import React from 'react';
import { Link } from 'react-router-dom';

import './ordering-success.scss';

const OrderingSuccess = () => {

	return (
		<div className="ordering-success">
			<div className="container">
				<div className="ordering-success__wrap">
					<div className="ordering-success__image">
						<svg width="140" height="140" viewBox="-15 0 420 420.955" fill="#6f9639" xmlns="http://www.w3.org/2000/svg"><path d="M319.45 256.25l-23.622-133.34c-2.086-13.445-13.691-23.344-27.297-23.289h-25.82V75.234C242.71 33.684 209.027 0 167.477 0c-41.551 0-75.235 33.684-75.235 75.234v24.387H66.426c-13.606-.058-25.211 9.844-27.301 23.29L.585 340.487c-.073.407-.108.813-.108 1.223.03 26.656 21.632 48.258 48.293 48.289h194.167c23.231 28.93 62.868 38.871 96.997 24.332 34.132-14.539 54.425-50.012 49.656-86.805-4.766-36.789-33.43-65.918-70.14-71.277zM106.241 75.234c0-33.82 27.418-61.234 61.235-61.234 33.82 0 61.234 27.414 61.234 61.234v24.387H106.242zM14.484 342.297l38.438-217.012.023-.133a13.581 13.581 0 0113.48-11.53h25.817v38.034a7.001 7.001 0 0014 0v-38.035h122.469v38.035c0 3.867 3.133 7 7 7s7-3.133 7-7v-38.035h25.82a13.577 13.577 0 0113.477 11.531l.023.133 23.055 130.145A82.812 82.812 0 00233.816 376H48.773c-18.703-.02-33.949-15.004-34.289-33.703zm293 64.652a69.1 69.1 0 01-55.464-28.094 68.798 68.798 0 0155.457-109.48c1.808 0 3.64.07 5.441.21 36.816 2.923 64.754 34.395 63.293 71.298-1.461 36.902-31.8 66.066-68.734 66.07zm0 0" /><path d="M342.992 311.352l-45.41 43.375-23.73-23.73a7.01 7.01 0 00-9.903 0 7.002 7.002 0 000 9.901l28.567 28.567a7 7 0 009.785.11l50.363-48.102a6.986 6.986 0 002.016-6.739 6.99 6.99 0 00-4.86-5.09 7.004 7.004 0 00-6.828 1.708zm0 0" /></svg>
					</div>
					{/* <img src={successImage} className="ordering-success__image" /> */}
					<h2 className="ordering-success__title">Ваш заказ успешно оформлен!</h2>
					<span className="ordering-success__text">
						Вы можете следить за выполнением своего заказа в
						<Link to="/orders" className="ordering-success__link">Личном кабинете</Link>
					</span>
				</div>
			</div>
		</div>
	);
}

export default OrderingSuccess;