import React from 'react';
import { NavLink } from 'react-router-dom';
import { withAuth } from '../hoc';

import {
	BtnAuthContainer, BtnCartContainer, BtnNavFavoritesContainer,
	BtnMainMenuContainer, MainMenuCloseContainer
} from '../../containers';

import './header.scss';

const headerContacts = (
	<div className="header__contacts">
		<div className="container">
			<div className="header__contacts-wrapper">
				<a className="header__tel" href="tel:+77777777777">+7 (777) 777-77-77</a>
				<a className="header__mail" href="mailto:email@email.com">email@email.com</a>
				<span className="header__delivery">доставка 3-5 рабочих дней и бесплатный возврат</span>
			</div>
		</div>
	</div>
);

export const Header = () => {

	return (
		<div className="header">
			{headerContacts}
			<div className="header__nav">
				<div className="container">
					<div className="header__nav-wrapper">
						<div className="header__btn-main-menu">
							<BtnMainMenuContainer />
						</div>

						<MainMenuCloseContainer>
							<NavLink to="/" className="header__logo" data-menu>
								<svg className="header__logo-image" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 394.522 394.522"><path d="M394.207 295.717a9.008 9.008 0 00-4.215-5.449c-67.566-38.659-151.56-23.144-201.406 32.792 14.499-79.55 82.334-140.722 164.962-144.99-1.154 22.74-6.585 44.671-16.187 65.317a9 9 0 004.366 11.956c4.507 2.097 9.859.142 11.956-4.366 12.009-25.823 18.098-53.46 18.098-82.145a9 9 0 00-9-9c-107.485 0-194.945 87.392-195.063 194.851-.011.467.015.94.08 1.414a8.927 8.927 0 00.911 2.907 9.02 9.02 0 003.695 3.791c25.271 14.423 52.821 21.272 80.032 21.272 56.252 0 111.011-29.296 140.896-81.519a8.988 8.988 0 00.875-6.831zm-191.504 61.436l57.331-15.6a9 9 0 006.321-11.047c-1.306-4.795-6.247-7.629-11.048-6.321l-57.331 15.6c41.781-51.217 114.434-67.877 174.859-38.253-37.086 56.157-108.159 78.606-170.132 55.621zm-52.939-88.559a308.286 308.286 0 00-19.043 1.908c-4.092-18.195-6.784-38.364-7.934-59.604a709.419 709.419 0 0064.098 2.413 9 9 0 008.931-9.068c-.038-4.97-4.087-9.01-9.068-8.931a691.594 691.594 0 01-64.561-2.527 454.303 454.303 0 01-.035-5.607c0-23.002 1.74-44.295 4.747-63.32a348.189 348.189 0 0044.911 2.886c18.417 0 36.743-1.394 54.515-4.086 2.029 12.538 3.516 26.15 4.317 40.741.272 4.963 4.537 8.773 9.479 8.493a8.999 8.999 0 008.493-9.48c-.814-14.835-2.372-29.248-4.601-42.9 23.139-4.74 45.006-11.733 64.481-20.75l.066-.031a158.253 158.253 0 0118.098 36.245 9 9 0 1017-5.916c-24.69-70.939-91.764-118.6-166.918-118.606h-.021C79.276 10.454 0 89.732 0 187.178c0 40.205 13.156 78.087 38.045 109.552 24.141 30.518 58.108 52.497 95.646 61.889a8.99 8.99 0 002.191.271c4.032 0 7.701-2.729 8.724-6.817 1.207-4.822-1.725-9.709-6.546-10.916-26.25-6.567-49.562-19.429-68.496-36.739 15.062-5.871 31.159-10.432 47.794-13.562 2.021 7.019 4.261 13.693 6.711 19.966a9 9 0 0011.657 5.109 9 9 0 005.109-11.657c-2-5.12-3.85-10.534-5.545-16.21a290.63 290.63 0 0115.711-1.513 9 9 0 008.359-9.598 8.989 8.989 0 00-9.596-8.359zM297.389 84.03c-17.052 7.531-36.369 13.515-56.748 17.707-3.62-16.603-8.298-31.696-13.888-44.565-4.399-10.129-8.999-18.157-13.638-24.492 32.964 7.77 62.473 25.893 84.274 51.35zM176.72 28.454c16.52 0 35.553 28.141 46.221 76.431-16.785 2.53-34.036 3.858-51.13 3.858-14.082 0-28.001-.879-41.614-2.607 10.36-48.017 29.113-77.682 46.523-77.682zm-133.323 72.68c20.455 8.945 42.595 15.633 65.756 19.928-3.281 20.706-5.001 43.083-5.001 66.116 0 1.27.005 2.54.016 3.804-29.899-3.404-58.768-8.773-85.705-15.991 2.066-27.065 10.952-52.263 24.934-73.857zm12.677 189.339c-22.653-26.48-36.51-60.347-37.949-96.958 27.312 7.072 56.452 12.32 86.553 15.633 1.099 22.791 3.905 44.535 8.256 64.228-19.916 3.827-39.124 9.588-56.86 17.097zm56.35-187.107c-20.405-3.784-39.942-9.53-58.101-17.134 21.753-26.329 51.819-45.551 86.14-53.6-6.348 8.59-12.112 19.572-17.109 32.757-4.347 11.47-8.008 24.243-10.93 37.977z" /></svg>
								<span className="header__logo-text">vegefoods</span>
							</NavLink>
						</MainMenuCloseContainer>
						<ul className="header__header-menu header-menu">
							<li className="header-menu__item">
								<MainMenuCloseContainer>
									<BtnAuthContainer />
								</MainMenuCloseContainer>
							</li>
							<li className="header-menu__item">
								<MainMenuCloseContainer>
									<BtnNavFavoritesContainer />
								</MainMenuCloseContainer>
							</li>
							<li className="header-menu__item">
								<MainMenuCloseContainer>
									<BtnCartContainer />
								</MainMenuCloseContainer>
							</li>
						</ul>
					</div>
				</div>
			</div>
		</div >
	);
}

export default withAuth(Header);